In [1]:
#Задание 1
#Скачайте с сайта https://grouplens.org/datasets/movielens/ датасет любого размера. 
#Определите какому фильму было выставлено больше всего оценок 5.0.

In [2]:
import pandas as pd

In [3]:
ratings = pd.read_csv('ml-latest-small/ratings.csv')
ratings.head()

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

In [4]:
movies = pd.read_csv('ml-latest-small/movies.csv')
movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [5]:
ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100836 entries, 0 to 100835
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   userId     100836 non-null  int64
 1   movieId    100836 non-null  int64
 2   rating     100836 non-null  float64
 3   timestamp  100836 non-null  int64
dtypes: float64(1), int64(3)
memory usage: 3.1 MB

In [7]:
#отбрасываем все оценки фильмов, кроме оценки 5.0
ratings1 = ratings[(ratings['rating'] == 5.0)]
#считаем сколько оценок 5.0 у каждого фильма
ratings1['movieId'].value_counts().head()

318     153
296     123
356     116
2571    109
260     104
Name: movieId, dtype: int64

In [8]:
#выводим название фильма по индексу с наибольшим количеством оценок
movies[movies['movieId'] == 318]['title'].head()

277    Shawshank Redemption, The (1994)
Name: title, dtype: object

In [9]:
#Задание 2
#По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония)
#категорий 4, 12 и 21 за период с 2005 по 2010 года. Не учитывайте в расчетах отрицательные значения 
#quantity.

In [10]:
data = pd.read_csv('power.csv')
data.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [11]:
data.tail()

          country  year  quantity  category
1189477  Viet Nam  2012      92.0        71
1189478  Viet Nam  2011      87.0        71
1189479  Viet Nam  2010      50.0        71
1189480  Viet Nam  2009      10.0        71
1189481  Viet Nam  2008       1.0        71

In [13]:
#оставляем только нужные нам страны
Baltics=data[(data['country']=='Latvia')|(data['country']=='Litva')|(data['country']=='Estonia')]
Baltics.head()

     country  year  quantity  category
5273  Latvia  2014       0.0         3
5274  Latvia  2013       1.0         3
5275  Latvia  2012       3.0         3
5276  Latvia  2011       0.0         3
5277  Latvia  2010       0.0         3

In [14]:
#оставляем только нужные категории
Baltics1 = Baltics[(Baltics['category']==4)|(Baltics['category']==12)|(Baltics['category']==21)]
#только нужный период
Baltics2 = Baltics1[(Baltics1['year']<=2010)&(Baltics1['year']>=2005)]
#не учитываем отрицательные значениия и находим сумму потребления
Baltics3 = Baltics2[(Baltics2['quantity']>=0)]
Baltics3['quantity'].sum()

118284.0

In [18]:
#Задание 3
#Выберите страницу любого сайта с табличными данными. Импортируйте таблицы в pandas dataframe.

In [23]:
#Посмотрим котировки биржевых товаров
page_url = 'https://www.finanz.ru/birzhevyye-tovary/v-realnom-vremeni'
#указываем нужный блок и кодировку страниц для отображения кириллицы
df = pd.read_html(page_url, attrs = {'class': 'header_user_pricebox'}, encoding='utf-8')

In [25]:
df[:5]

[     0       1      2        3       4     5        6       7      8   \
 0  ММВБ   2 897  -0,6%   Nasdaq  10 914  2,3%  Биткойн  10 903   1,2%
 1   РТС   1 165  -2,0%   S&P500   3 298  1,6%    Нефть     417  -0,2%
 2   Dow  27 174   1,3%  FTSE100   5 843  0,3%   Золото   1 862   0,0%

         9       10    11
 0  USD/RUB  782235  0,1%
 1  EUR/RUB  908760  0,0%
 2  EUR/USD   11635  0,0%  ]